#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.storage.module.audit_st.data.azurerm_private_dns_zone.storage_account["blob"]: Still reading... [10s elapsed]
module.storage.module.audit_st.data.azurerm_private_dns_zone.storage_account["queue"]: Still reading... [10s elapsed]
module.web_apps_itn.data.azurerm_storage_account.fims: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.key_vaults_itn.azurerm_key_vault.fims_itn_key_vault will be created
  + resource "azurerm_key_vault" "fims_itn_key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-fims-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-fims-rg-01"
      + sku_name                      = "premium"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.key_vaults_itn.azurerm_key_vault_key.op_app will be created
  + resource "azurerm_key_vault_key" "op_app" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "sign",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "op-app-key"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_admin_certificates will be created
  + resource "azurerm_role_assignment" "adgroup_admin_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_admin_keys will be created
  + resource "azurerm_role_assignment" "adgroup_admin_keys" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_admin_secrets will be created
  + resource "azurerm_role_assignment" "adgroup_admin_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_developers_certificates will be created
  + resource "azurerm_role_assignment" "adgroup_developers_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_developers_keys will be created
  + resource "azurerm_role_assignment" "adgroup_developers_keys" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_developers_secrets will be created
  + resource "azurerm_role_assignment" "adgroup_developers_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_externals_certificates will be created
  + resource "azurerm_role_assignment" "adgroup_externals_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "40bbc0a5-547d-40f8-83df-81409a871b02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_externals_keys will be created
  + resource "azurerm_role_assignment" "adgroup_externals_keys" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "40bbc0a5-547d-40f8-83df-81409a871b02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_externals_secrets will be created
  + resource "azurerm_role_assignment" "adgroup_externals_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "40bbc0a5-547d-40f8-83df-81409a871b02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_cd_certificates will be created
  + resource "azurerm_role_assignment" "identity_fims_cd_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ea69d874-1695-46aa-8737-85fa67dc882d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_cd_secrets will be created
  + resource "azurerm_role_assignment" "identity_fims_cd_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ea69d874-1695-46aa-8737-85fa67dc882d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_ci_certificates will be created
  + resource "azurerm_role_assignment" "identity_fims_ci_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "452b7c46-b8f1-481e-a22d-8f2249ebe63a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_ci_secrets will be created
  + resource "azurerm_role_assignment" "identity_fims_ci_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "452b7c46-b8f1-481e-a22d-8f2249ebe63a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmos.module.comsosdb_sql_container_op_access_tokens.azurerm_cosmosdb_sql_container.this,
  on .terraform/modules/cosmos.comsosdb_sql_container_op_access_tokens/cosmosdb_sql_container/main.tf line 7, in resource "azurerm_cosmosdb_sql_container" "this":
   7:   partition_key_path = var.partition_key_path

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and 14 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmos.cosmosdb_account_fims/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
